================================================================================
Function Call: No Arguments
================================================================================

rand()

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)))

================================================================================
Function Call: With Arguments
================================================================================

eye(1, 2)
inv(A,)
eigs (A)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (number)
      (number)))
  (function_call
    (identifier)
    (arguments
      (identifier)))
  (function_call
    (identifier)
    (arguments
      (identifier))))

================================================================================
Function Call: Indexing With Ranging Operator
================================================================================

disp(:)
A(1, :)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (ranging_operator)))
  (function_call
    (identifier)
    (arguments
      (number)
      (ranging_operator))))

================================================================================
Function Call: With Last Index
================================================================================

A($)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (last_index))))

================================================================================
Function Call: Nested Calls
================================================================================

function y = a(x)
    y = x
endfunction

function y = b(u)
   y = a
end

b(:)(3)

--------------------------------------------------------------------------------

(source_file
  (function_definition
    (function_output
      (identifier))
    (identifier)
    (arguments
      (identifier))
    (block
      (assignment
        (identifier)
        (identifier))))
  (function_definition
    (function_output
      (identifier))
    (identifier)
    (arguments
      (identifier))
    (block
      (assignment
        (identifier)
        (identifier))))
  (function_call
    (function_call
      (identifier)
      (arguments
        (ranging_operator)))
    (arguments
      (number))))

================================================================================
Function Call: Named Arguments
================================================================================

func(a=1, b=2)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arguments
      (assignment
        (identifier)
        (number))
      (assignment
        (identifier)
        (number)))))
