================================================================================
Range: Positive Numbers
================================================================================

1:2
1:2:3
1:0.1:2
0:1e-3:1

--------------------------------------------------------------------------------

(source_file
  (range
    (number)
    (number))
  (range
    (number)
    (number)
    (number))
  (range
    (number)
    (number)
    (number))
  (range
    (number)
    (number)
    (number)))

================================================================================
Range: Negative Numbers
================================================================================

-1:1
1:-.1:0
10:-1:-10
1:-1e-3:-1

--------------------------------------------------------------------------------

(source_file
  (range
    (number)
    (number))
  (range
    (number)
    (number)
    (number))
  (range
    (number)
    (number)
    (number))
  (range
    (number)
    (number)
    (number)))

================================================================================
Range: Variables
================================================================================

a:b
a:b:c

--------------------------------------------------------------------------------

(source_file
  (range
    (identifier)
    (identifier))
  (range
    (identifier)
    (identifier)
    (identifier)))

================================================================================
Range: Function Call
================================================================================

1:a(1):2
b():a(1):c()

--------------------------------------------------------------------------------

(source_file
  (range
    (number)
    (function_call
      (identifier)
      (number))
    (number))
  (range
    (function_call
      (identifier))
    (function_call
      (identifier)
      (number))
    (function_call
      (identifier))))
